export const ru = {
    profileSettingPage: {
        generalInformation: 'Общая Информация',
        devices: 'Устройства',
        accountManagement: 'Управление Аккаунтом',
        myPayments: 'Платежи',
        addProfilePhoto: 'Добавить Фото',
        userName: 'Имя Пользователя',
        firstName: 'Имя',
        lastName: 'Фамилия',
        dateOfBirthday: 'Дата Рождения',
        city: 'Город',
        aboutMe: 'Расскажите о себе',
        deleteProfile: 'Удалить Профиль',
        saveChanges: 'Сохранить',
    },

    sidebar: {
        home: 'Главная',
        myProfile: 'Профиль',
        message: 'Сообщения',
        create: 'Создать',
        statistics: 'Статистика',
        favorites: 'Избранное',
        logOut: 'Выйти',
    },

    profile: {
        profileSettings: 'Настройки Профиля',
        following: 'Подписки',
        followers: 'Подписчики',
        publications: 'Публикации',
    },

    create: {
        createNewPost: 'Создание публикации',
        selectAPhotoInYourComputer: 'Перетащите сюда фото',
        crop: 'Обрезать',
        publication: 'Создание публикации',
        next: 'Далее',
        publish: 'Поделиться',
        original: 'Оригинал',
        addPublicationDescriptions:' Добавьте описание',
        yourPostHasBeenShared: 'Публикация размещена',
        cancelPublication: 'Отменить публикацию ?',
        changesWillNotBeSaved: 'Если вы выйдете, изменения не будут сохранены.',
        delete: 'Удалить',
        cancel: 'Отмена'
    },

    login: {
        signIn: 'Войти',
        email: 'Эл. адрес',
        password: 'Пароль',
        forgotPassword: 'Забыли пароль?',
        hasAccount: 'У вас ещё нет аккаунта?',
        signUp: 'Зарегистрироваться'
    },

    register: {
        signUp: 'Зарегистрироваться',
        userName: 'Имя пользователя',
        email: 'Эл. почта',
        password: 'Пароль',
        passwordConfirm: 'Повторите пароль',
        hasAccount: 'Уже есть аккаунт?',
        signIn: 'Войти',
        agree: 'Я согласен с',
        terms: 'Условиями обслуживания',
        and: 'и',
        policy: 'Политикой конфиденциальности',
    },

    passwordRecovery: {
        forgotPassword: 'Не удается войти?',
        email: 'Email',
        description: 'Введите свой электронный адрес, и мы отправим вам дальнейшие инструкции.',
        sendLink: 'Получить ссылку для входа',
        backSignIn: 'Вернуться к входу',
        createPassword: 'Создать пароль',
        newPassword: 'Новый пароль',
        passwordConfirm: 'Повторите пароль',
        passwordLength: 'Пароль должен содержать от 6 до 20 символов',
    },

    logOutModal: {
        logOut: 'Выйти',
        confirmation: 'Вы уверенны что хотите выйти из аккаунта?',
    },

    validationMessages: {
        emailRequired: 'Введите адрес эл.почты',
        emailCorrect: 'Введите корректный адрес эл.почты',
        passwordRequired: 'Введите пароль',
        passwordNotMatch: 'Пароли не совпадают',
        userNameRequired: 'Введите имя пользователя'
    },

    common: {
        selectFromComputer: 'Выбрать на компьютере',
        yes: 'Да',
        no: 'Нет',
    },
    terms: {
        backToSignIn: 'Вернуться к входу',
        termsTitle: 'Условия использования',
        lastUpdated: 'Последнее обновление: [28.08.23]',
        intro: 'Пожалуйста, внимательно ознакомьтесь с этими Условиями использования ("Условия"), прежде чем начать использовать нашу службу. Настоящие Условия регулируют ваше использование [название вашей службы] ("Служба") и взаимодействие с ней.',
        acceptanceTitle: 'Принятие Условий',
        acceptanceContent: 'Используя нашу Службу, вы соглашаетесь соблюдать и подчиняться настоящим Условиям. Если вы не согласны с этими Условиями, пожалуйста, не используйте нашу Службу.',
        changesTitle: 'Изменения и Обновления',
        changesContent: 'Мы можем периодически вносить изменения в настоящие Условия. Любые обновления или изменения будут опубликованы на нашей Службе, и ваше дальнейшее использование Службы после таких изменений означает ваше согласие с обновленными Условиями.',
        privacyTitle: 'Конфиденциальность',
        privacyContent: 'Ваше использование Службы регулируется нашей Политикой конфиденциальности. Пожалуйста, ознакомьтесь с этой политикой, чтобы понимать, как мы обрабатываем ваши данные.',
        usageAndContentTitle: 'Использование и Содержание',
        usageAndContentContent: '4.1. Вы соглашаетесь использовать Службу только в законных целях и в соответствии с настоящими Условиями.\n4.2. Вы несете ответственность за контент, который вы размещаете или делитесь с помощью Службы, и обязуетесь соблюдать законы и правила в отношении содержания.\n4.3. Мы оставляем за собой право удалить или ограничить доступ к контенту, который нарушает настоящие Условия или применимые законы.',
        liabilityTitle: 'Ответственность',
        liabilityContent: 'Мы не несем ответственности за убытки, понесенные вами в результате использования Службы. Ваше использование Службы осуществляется на ваш риск.',
        warrantiesTitle: 'Заверения и Гарантии',
        warrantiesContent: 'Мы не даем никаких явных или подразумеваемых гарантий в отношении Службы. Мы предоставляем Службу "как есть" и "как доступно".',
        contactTitle: 'Свяжитесь с нами',
        contactContent: 'Если у вас есть вопросы или замечания относительно наших Условий использования, свяжитесь с нами по следующему адресу: [ваш контактный адрес].',
    },
    privacyPolicy: {
        backToSignIn: 'Вернуться к входу',
        policyTitle: 'Политика конфиденциальности',
        lastUpdated: 'Последнее обновление: [28.08.23]',
        intro: 'Пожалуйста, внимательно ознакомьтесь с этой Политикой конфиденциальности перед использованием нашей службы. Данная Политика регулирует сбор, использование и раскрытие ваших персональных данных при использовании нашей службы.',
        agreementTitle: 'Согласие с условиями',
        agreementContent: 'Используя нашу Службу, вы соглашаетесь с условиями настоящей Политики конфиденциальности. Если вы не согласны с этой Политикой, пожалуйста, не используйте нашу Службу.',
        collectionTitle: 'Сбор и использование информации',
        collectionContent: 'Мы можем собирать и использовать информацию о вас в соответствии с нашей Политикой конфиденциальности. Чтобы узнать больше о том, как мы собираем и используем вашу информацию, пожалуйста, прочитайте нашу Политику конфиденциальности.',
        usageTitle: 'Использование информации',
        usageContent: 'Мы используем собранную информацию для предоставления и улучшения Службы. Ваше использование Службы означает согласие с нашей практикой использования информации, описанной в нашей Политике конфиденциальности.',
        securityTitle: 'Безопасность',
        securityContent: 'Мы принимаем меры для обеспечения безопасности ваших данных. Однако ни один метод передачи или хранения данных в сети не является абсолютно надежным, и мы не можем гарантировать его абсолютную безопасность.',
        contactTitle: 'Свяжитесь с нами',
        contactContent: 'Если у вас есть вопросы или замечания относительно нашей Политики конфиденциальности, свяжитесь с нами по следующему адресу: [ваш контактный адрес].',
    },
}

export type LocaleType = typeof ru

export type LocaleSidebarType = LocaleType["sidebar"]
export type LocaleProfileType = LocaleType["profile"]
